Revit 2026 API

# AppearanceAssetEditScopeCancel Method

---

Cancels the edit scope.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Cancel()
```
```vb
Public Sub Cancel
```
```cpp
public:
void Cancel()
```
```fsharp
member Cancel : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | EditScope is not active. EditScope can only be committed or cancelled when it is active. -or- EditScope cannot be closed, there is no opened transaction. |

All the changes made after starting the EditScope will be discarded.

#### Reference

AppearanceAssetEditScope Class

Autodesk.Revit.DB.Visual Namespace